## Webscraping part 2

In [2]:
import pandas as pd
import requests
from bs4 import BeautifulSoup

In [8]:
url = 'https://en.wikipedia.org/wiki/Table_(information)'
web = requests.get(url)
soup = BeautifulSoup(web.text, 'html')

In [12]:
table = soup.find('table')

table_tittle = [header.text.strip() for header in table.find_all('th')]
table_tittle_pd = pd.DataFrame(columns=table_tittle)

In [14]:
table_tittle_pd

Empty DataFrame
Columns: [First name, Last name, Age, Gender]
Index: []

In [16]:
rows = table.find_all('tr')
row_data = []

In [20]:
for row in rows:
    cells = row.find_all('td')
    cell_text = [cell.text.strip() for cell in cells]
    if cell_text:
        row_data.append(cell_text)

In [26]:
for row in row_data:
    if len(row) == len(table_tittle) and len(table_tittle_pd) < 9:
        if row not in table_tittle_pd.values.tolist():
            table_tittle_pd.loc[len(table_tittle_pd)] = row

In [28]:
print(table_tittle_pd)

  First name   Last name Age Gender
0       Tinu    Elejogun  14      F
1     Javier      Zapata  28      M
2       Lily   McGarrett  18      F
3  Olatunkbo    Chijiaku  22      M
4   Adrienne    Anthoula  22      M
5     Axelia  Athanasios  22      M
6  Jon-Kabat        Zinn  22      M
7    Thabang       Mosoa  15      F
8      Rhian       Ellis  12      M

In [30]:
table_tittle_pd

  First name   Last name Age Gender
0       Tinu    Elejogun  14      F
1     Javier      Zapata  28      M
2       Lily   McGarrett  18      F
3  Olatunkbo    Chijiaku  22      M
4   Adrienne    Anthoula  22      M
5     Axelia  Athanasios  22      M
6  Jon-Kabat        Zinn  22      M
7    Thabang       Mosoa  15      F
8      Rhian       Ellis  12      M

###### No duplicates anymore